#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_ssm_sops.data.sops_file.sops_secret: Reading...
module.ecs_ssm_sops.data.sops_file.sops_secret: Read complete after 0s [id=-]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07370bdafa53b8c4f]
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_PASSWORD"]: Refreshing state... [id=DB_PASSWORD]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:378842471989:cluster/travelapp-cluster]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=travelapp-ecr]
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_USERNAME"]: Refreshing state... [id=DB_USERNAME]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Reading...
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_HOSTNAME"]: Refreshing state... [id=DB_HOSTNAME]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Read complete after 0s [id=1077804475]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Read complete after 0s [id=3750463013]
module.ecs_taskdef_travelapp.aws_iam_role.main: Refreshing state... [id=ECS-TravelApp-Role]
module.ecs_taskdef_travelapp.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::378842471989:policy/ECS-Allow-All]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.example: Refreshing state... [id=travelapp-cluster]
module.ecs_taskdef_travelapp.aws_iam_role_policy_attachment.main: Refreshing state... [id=ECS-TravelApp-Role-20231214174657259600000001]
module.vpc.aws_route_table.main: Refreshing state... [id=rtb-0299c90bb8997687c]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-03ab51c457fad06d3]
module.vpc.aws_subnet.public_subnets[1]: Refreshing state... [id=subnet-0299bc63a7ad5223e]
module.rds_public_sg.aws_security_group.main: Refreshing state... [id=sg-079b9b8919dff4d83]
module.public_sg.aws_security_group.main: Refreshing state... [id=sg-0feda0c9e5bab127f]
module.vpc.aws_subnet.public_subnets[0]: Refreshing state... [id=subnet-01a9331b22ab97a18]
module.vpc.aws_route.igw_route[0]: Refreshing state... [id=r-rtb-0299c90bb8997687c1080289494]
module.vpc.aws_route_table_association.public_subnets_route_association[0]: Refreshing state... [id=rtbassoc-064ff63696fb58293]
module.vpc.aws_route_table_association.public_subnets_route_association[1]: Refreshing state... [id=rtbassoc-08029f31cc5f59667]
module.ecs_taskdef_travelapp.aws_ecs_task_definition.main: Refreshing state... [id=travelapp-taskdefintion]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_taskdef_travelapp.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:378842471989:task-definition/travelapp-taskdefintion:6" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:378842471989:task-definition/travelapp-taskdefintion" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu          = 512
                  - environment  = []
                  - essential    = true
                  - image        = "378842471989.dkr.ecr.us-east-1.amazonaws.com/travelapp-ecr:1"
                  - memory       = 1024
                  - mountPoints  = []
                  - name         = "travelapp-container"
                  - portMappings = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets      = [
                      - {
                          - name      = "DB_HOST"
                          - valueFrom = "test"
                        },
                    ]
                  - volumesFrom  = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "travelapp-taskdefintion" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "Name" = "travelapp-taskdefintion"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "travelapprds"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.33"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "travelapp-identifier"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Example"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive value)
      + vpc_security_group_ids                = [
          + "sg-0feda0c9e5bab127f",
        ]
    }

  # module.rds.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-01a9331b22ab97a18",
          + "subnet-0299bc63a7ad5223e",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Example"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  - DB_HOSTNAME_SOPS         = "test" -> null
  + db_hostname_sops         = (sensitive value)
  + db_password_sops         = (sensitive value)
  + db_username_sops         = (sensitive value)
  + rds_db_hostname          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*